{
  "last_updated": "2025-09-13T08:31:52.758657",
  "total_products": 10,
  "successful_prices": 10,
  "api_used": true,
  "products": [
    {
      "asin": "B0CZ5RYBWW",
      "title": "DJI Power 1000 Portable Power Station, 1024Wh LiFePO4 Battery, 2200W (Peak 2600W) AC/140W USB-C Output, 23db Ultra-Silent, Solar Generator For Home Backup, Camping(Solar Panel Optional)",
      "price": "$499.00",
      "currency": "USD",
      "features": [
        "The Power from DJI - Unleash rock-solid portable energy with DJI Power 1000. Experience unparalleled reliability, premium performance, and the peace of mind only DJI can offer. Wherever your journey takes you, trust DJI to power your every need.",
        "Next-Gen Fast Recharging Technology - With DJI's advanced fast-charging technology, Power 1000 gets you back to 100% power in just 70 minutes (0-80% in 50 minutes) using grid power or 80 minutes with a solar panel. So you can dive into your next trip or outdoor adventure without delay.",
        "Dual 140W USB-C Fast Charging Output - Utilize DJI's leading technology with dual 140W USB-C fast charging output. Efficiently charge high-power devices like the 16-inch MacBook Pro, gaming laptops, tablets, cameras, and other essentials. Meet dynamic power needs and enjoy fast, reliable charging wherever you go.",
        "23 dB Whisper-Silent - Enjoy the peace of DJI Power 1000, operating at 23 dB ultra-silent, quieter than a whisper. Certified by five SGS noise tests, it guarantees no disturbance, even in the most serene settings. Recharge your devices in peace and comfort.",
        "Return Policy Avaliable - Due to logistic regulations, please use the product's original packaging when shipping a power station. It is recommended to retain the original packaging during the product's refund period.",
        "Fast Charges DJI Drones - With optional charging cables, quickly power select DJI drone batteries like MAVIC 3 Series and Air 3 Series. Enjoy extended flight time and expand your creative horizons.",
        "Safe and Secure - Features an LFP battery supporting up to 4000 cycles, ensuring a service life of 10 years. With 26 SGS certifications, it guarantees top-tier safety and reliability. The advanced DJI Battery Management System (BMS) prevents over-current, over-voltage, and over-discharge, keeping your device protected.",
        "5 Years of Warranty - DJI Power 1000 units come with a 3-year warranty, extendable to 5 years with easy registration. Enjoy 5 years of worry-free use, knowing your investment is fully protected.",
        "What's in the box - DJI Power 1000 *1, DJI Power AC Power Cable *1."
      ],
      "last_updated": "2025-09-13T08:31:52.757428",
      "price_available": true,
      "api_source": true,
      "output_wattage": "2200",
      "battery_capacity": "1024",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "DJI Power 1000 Portable Power Station, 1024Wh LiFePO4 Battery, 2200W (Peak 2600W) AC/140W USB-C Output, 23db Ultra-Silent, Solar Generator For Home Backup, Camping(Solar Panel Optional)",
      "affiliate_link": "https://amzn.to/4nuXr7n"
    },
    {
      "asin": "B0CLG6FYLQ",
      "title": "BLUETTI Solar Generator AC70, 768Wh LiFePO4 Battery Backup w/ 2 1000W AC Outlets (Power Lifting 2000W), 100W Type-C, for Road Trip, Off-grid, Power Outage (Solar Panel Optional)",
      "price": "$569.00",
      "currency": "USD",
      "features": [
        "[Power for All Essentials] - With a capacity of 768Wh, 1000W inverter and 2000W power lifting, this solar generator is the ideal solution to power all your important devices and devices during a trip.",
        "[1.5 Hours AC Charging] - No bulky power adapter, a single cable is enough to charge it with a maximum of 950W; 0-80% in just 45 mins and 0-100% in 1.5 hours with AC input.",
        "[Up to 500W Solar] - Fully charge the AC70 solar generator in 1.9-2.4 hours with max. 500W clean, environmentally friendly, renewable solar energy.",
        "[APP Remote Control] - BLUETTI APP allows you to monitor AC70 status, set charge/discharge mode and update battery version on your phone. Smart management is easy to achieve.",
        "[What You Get] - BLUETTI solar generator AC70, AC charging cable, car charging cable, solar charging cable, user manual."
      ],
      "last_updated": "2025-09-13T08:31:52.757738",
      "price_available": true,
      "api_source": true,
      "output_wattage": "1000",
      "battery_capacity": "768",
      "fuel_type": "Battery",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "BLUETTI Solar Generator AC70, 768Wh LiFePO4 Battery Backup w/ 2 1000W AC Outlets (Power Lifting 2000W), 100W Type-C, for Road Trip, Off-grid, Power Outage (Solar Panel Optional)",
      "affiliate_link": "https://amzn.to/3Keq1LE"
    },
    {
      "asin": "B0BVLPGS79",
      "title": "EF ECOFLOW Portable Power Station RIVER 2 Pro, 768Wh LiFePO4 Battery, 70 Min Fast Charging, 4X800W (X-Boost 1600W) AC Outlets, Solar Generator for Outdoor Camping/RVs/Home Use Black",
      "price": "$379.00",
      "currency": "USD",
      "features": [
        "[Fastest Charging in the Industry] - Fully recharge using an AC outlet in only 70 minutes with EcoFlow’s X-Stream fast charging technology.",
        "[Power 80% of Your Appliances] - With an output of up to 1600W, run 80% off all your appliances, even high wattage ones. With 11 outlets, from 800W AC outlets to USB-C, simultaneously charge or run all your devices without worrying about overloading.",
        "[LFP Long-Life Battery] - Using LFP battery cells, use and recharge RIVER 2 Pro more than 3000 times before hitting 80%. That’s almost 10 years of regular use. RIVER 2 Pro includes advanced BMS protection, monitoring voltage, current, and temperature to keep your LFP battery running for years.",
        "[Fast Solar Charging] - Use clean, green renewable energy to recharge RIVER 2 Pro, in as fast as 3.5 hours with 220W solar input.",
        "[Light & Portable] - With a lightweight of only 17.2 lbs, RIVER 2 Pro is the ideal outdoor generator for all your off-grid adventures. With a built-in handle, this portable battery is easy and convenient to take anywhere you need power.",
        "[What’s included] - RIVER 2 Pro portable power station, AC charging cable, DC5521 Connection Cable, User manual, and a 5-year service."
      ],
      "last_updated": "2025-09-13T08:31:52.757783",
      "price_available": true,
      "api_source": true,
      "output_wattage": "800",
      "battery_capacity": "768",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "EF ECOFLOW Portable Power Station RIVER 2 Pro, 768Wh LiFePO4 Battery, 70 Min Fast Charging, 4X800W (X-Boost 1600W) AC Outlets, Solar Generator for Outdoor Camping/RVs/Home Use Black",
      "affiliate_link": "https://amzn.to/47D9dI1"
    },
    {
      "asin": "B09XM7WDZ2",
      "title": "Anker SOLIX F2000 Portable Power Station, PowerHouse 767, 2400W Solar Generator, GaNPrime Battery Generators for Home Use, LiFePO4 Power Station for Outdoor Camping, and RVs (Solar Panel Optional)",
      "price": "$1999.00",
      "currency": "USD",
      "features": [
        "[Longest-Lasting 10-Year Lifespan] - With InfiniPower's long-lasting technology, Anker PowerHouse 767 is built to last over a decade, even with everyday use.",
        "[Rapid Recharge] - Thanks to HyperFlash technology, Anker PowerHouse 767 can be charged from 0 to 80% in just 1.4 hour.",
        "[Power Up to 12 Devices] - The 2400W output and an exclusive RV port, 4 AC ports, 3 USB-C charging ports, 2 USB-A ports, and 2 car outlets can power almost all your devices at once. Power high-wattage devices up to 3600W without overloading the portable power station thanks to SurgePad technology.",
        "[5-Year Full-Device Warranty] - Anker PowerHouse 767 comes with a 5-year full-device warranty for a worry-free experience.",
        "[What You Get] - Anker SOLIX F2000 Portable Power Station (GaNPrime PowerHouse 2048Wh), 5-year warranty, AC charging cable, car charging cable, solar charging cable, user manual, and our friendly customer service."
      ],
      "last_updated": "2025-09-13T08:31:52.757835",
      "price_available": true,
      "api_source": true,
      "output_wattage": "2400",
      "battery_capacity": "1048",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "Anker SOLIX F2000 Portable Power Station, PowerHouse 767, 2400W Solar Generator, GaNPrime Battery Generators for Home Use, LiFePO4 Power Station for Outdoor Camping, and RVs (Solar Panel Optional)",
      "affiliate_link": "https://amzn.to/3VvFERD"
    },
    {
      "asin": "B0DKJ7P5L8",
      "title": "Jackery Solar Generator 5000 Plus Portable Power Station with 2x 500W Solar Panels and Smart Transfer Switch, 5040Wh Power Station, 7200W AC Output Solar Generator for Home Use, Emergency Backup",
      "price": "$5199.00",
      "currency": "USD",
      "features": [
        "Whole-Home Backup: With 7200W to 14400W expandable output and 5kWh to 60kWh capacity, the Solar Generator 5000 Plus powers your whole home for over 1 day with a single unit. Based on average daily electricity usage during blackouts in American households, when expanded to 30kWh, it provides backup for up to 7 days, and with 60kWh, it can last up to 15 days.",
        "Versatile for All: Equipped with 120V/240V dual voltage output, the Jackery Solar Generator 5000 Plus easily powers everyday devices and heavy-duty equipment like dryers, water pumps, and ovens, while also serving as a reliable solution for recharging RVs.",
        "0ms UPS: Thanks to its 0ms response time in Online UPS mode, the Solar Generator 5000 Plus automatically switches to stored power during blackouts, ensuring your critical devices like your refrigerator, WiFi, aquarium, computer, and data center, remain powered and functional.",
        "Smart App Control: The Jackery App allows you to monitor your solar generator in real-time and adjust charge/discharge settings via WiFi or Bluetooth. Features like automatic off-peak charging and peak shaving with the smart transfer switch help lower your energy bills.",
        "Quiet and Clean: The Solar Generator 5000 Plus is your sustainable, zero-emission alternative to diesel generators, eliminating CO and pollution risks. Charging silently at under 30dB, this whisper-quiet solar generator creates a peaceful environment for reading or other activities—even during power outages."
      ],
      "last_updated": "2025-09-13T08:31:52.757956",
      "price_available": true,
      "api_source": true,
      "output_wattage": "7200",
      "battery_capacity": "5040",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "Jackery Solar Generator 5000 Plus Portable Power Station with 2x 500W Solar Panels and Smart Transfer Switch, 5040Wh Power Station, 7200W AC Output Solar Generator for Home Use, Emergency Backup",
      "affiliate_link": "https://amzn.to/46eaByB"
    },
    {
      "asin": "B0DTTVWHBG",
      "title": "DABBSSON 2000L Solar Generator(2025 New), 2048Wh Semi-Solid LiFePO4, 2200W AC Output×6, P-Boost 3300W, Compact&Lightweight, 1.3X Runtime, Portable Power Station for Camping/Home/RV",
      "price": "$709.00",
      "currency": "USD",
      "features": [
        "[Ultra-Compact & Lightweight] Who says power has to be bulky? Dabbsson 2000L delivers 2kWh in a sleek 11.2 × 18.3 × 8.9 in frame, weighing just 41 lbs—smaller and lighter than most in its class. With a built-in handle and UL94-V0 fire-resistant design, it provides safe, portable power anywhere, and plus a built-in LED light for emergencies.",
        "[1.3X Extended Runtime] Powered by semi-solid LiFePO4 cells and an AI-driven BMS, Dabbsson 2000L delivers 1.3X longer runtime—ideal for home, job sites, or the outdoors. Enjoy 2048Wh of stable power with 4000+ charge cycles and 10+ years of performance. 56+ protection layers and thermal control ensure long-term safety and durability.",
        "[Massive Output for 12 Devices] With 2200W rated output and P-Boost up to 3300W, Dabbsson Solar Powered Generator can power power-hungry tools, outdoor equipment, and multiple electronics at once. Includes 6× AC outlets, 2× USB-C (100W&30W), 2× USB-A, 1× Car Port, and 1× DC5521—power up to 12 devices simultaneously with intelligent current management.",
        "[Ultra-Fast Charging] Recharge to 80% in just 1.5 hours with 1500W AC input, or stay charged off-grid with up to 800W solar input (MPPT supported). Car charging and dual AC+solar input options give you flexible recharging anywhere you go.",
        "[Smart App Control] Use the Dabbsson App to monitor power status, adjust AC charging speed, schedule off-peak charging, and more—all from your phone(Wi-Fi/Bluetooth). Enjoy ultra-quiet operation modes and seamless backup with <15ms EPS switching, perfect for remote work or off-grid camping.",
        "[What's Included & Caring Support] Package includes: 1× Dabbsson 2000L portable power station, 1× AC charging cable, 1× car charging cable, and 1× user manual. Backed by an industry-leading 5-year warranty (3 years standard + 2-year extended). Need help? Our customer service team is always here to help — just a message or call away."
      ],
      "last_updated": "2025-09-13T08:31:52.758006",
      "price_available": true,
      "api_source": true,
      "output_wattage": "2200",
      "battery_capacity": "2048",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "DABBSSON 2000L Solar Generator(2025 New), 2048Wh Semi-Solid LiFePO4, 2200W AC Output&6, P-Boost 3300W, Compact&Lightweight, 1.3X Runtime, Portable Power Station for Camping/Home/RV",
      "affiliate_link": "https://amzn.to/4pdQbyt"
    },
    {
      "asin": "B0CHFM3V8Q",
      "title": "Portable Solar Generator, 300W Portable Power Station with Foldable 60W Solar Panel, 110V Pure Sine Wave 280Wh Lithium Battery Pack with USB DC AC Outlet for Home Use RV Van Outdoor Camping-Orange",
      "price": "$229.98",
      "currency": "USD",
      "features": [
        "Portable Generator with 60W Solar Panel Included: With a superior lithium-ion battery pack, ZeroKor 300W power stations are powerful enough to charge smartphones,tablets,laptops,headphones or other outdoor Small Camping supplies (Tips:Using electrical appliances over 300W may damage the portable solar generator, especially some devices that are prone to heat or built-in air compressor such as coffee maker,Hair dryer, water pump etc )",
        "Multiple Charging outlets for camping gear with SOS Flashlight: With 2* 110V/300W Max AC outlets, 1* DC port (9V-12.6V/10A max ), 3* 5V/3A MAX USB ports, 1*quick charge USB port (5V/3A 9V/2A Max), Flashlight with reading mode and SOS mode for your outdoor RV Adventures, our portable solar power station offers a versatile charging solution,allowing you to charge your devices directly from a wall AC outlet",
        "Multiple Charging Optional, Solar Panel 60W Included: ZeroKor portable power bank generator can be recharged by wall AC outlet, DC5521 Solar Panel (Portable Power Station built-in MPPT), Carport. Take the portable generator with you on-the-go and never worry about power shortage,the portable AC outlet design makes it more suitable for Tent camping OFF-Grid life",
        "Configure Multiple Protection Mechanisms: Built in BMS, ZeroKor portable power station features short circuit protection, over-current protection, over-voltage protection, overload protection and overheating protection. The built-in cooling fan system will automatically start and stop according to the portable battery pack internal temperature during use. Acting as a portable solar power bank, it accommodates multiple devices simultaneously, making it perfect for indoor and outdoor use",
        "HIGH CONVERSION EFFICIENCY: ZeroKor solar panels 60W monocrystalline solar cell have a high conversion efficiency of 20.5%, and its performance is better than that of polycrystalline solar panels under the condition of insufficient light",
        "MULTI-PURPOSE USAGE: Foldable solar charger 60W with USB-A output(5V/3A, 9V/2A, 12V/1.5A),USB-C output(5V/3A, 9V/2A, 12V/1.5A ,15V/2A Max), can charge for small devices including smartphones, tablets, digital cameras etc, Equipped with DC interface(18V/3.3A 60W Max), which can charge portable power station( NOTE: The junction box is not waterproof and please keep it dry)",
        "Good Ideal, The Wise Choice of Camping Accessories,7*24 Hr Customer Service: ZeroKor portable power station is the holiday goods for friends or family member who loves travel outdoor. We offer professional customer assistance . Package includes 1*300W Portable Power Station, 1*AC power adapter, 1*Cigarette Lighter Adapter, 1*12V Car Charging Cable,1* Zerokor 60W Solar Panel Kit and 2*user manual",
        "Warm Reminder For You: The portable solar generator performance is maintained by charging and discharging, Not charging for a long time may cause the unit to enter protection state,more than 300W power devices will cause the portable generator unavailable, please don't use up the unit's power,keep the battery capacity at 60%-80%(it is not recommended that the portable generator be used only as an emergency power supply)"
      ],
      "last_updated": "2025-09-13T08:31:52.758046",
      "price_available": true,
      "api_source": true,
      "output_wattage": "300",
      "battery_capacity": "380",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "ZeroKor Portable Solar Generator, 300W Portable Power Station with Foldable 60W Solar Panel, 110V Pure Sine Wave 280Wh Lithium Battery Pack with USB DC AC Outlet for Home Use RV Van Outdoor Camping-Orange",
      "affiliate_link": "https://amzn.to/4n0UDyW"
    },
    {
      "asin": "B0FG24VHMF",
      "title": "ALLPOWERS 600w Portable Power Station, 299Wh LiFePO4 Battery Backup, R600(Peak 1200w) Solar Generator, 1 Hour Fast Charge Solar Power Bank, for Home Outdoor Travel Emergency RV",
      "price": "$219.00",
      "currency": "USD",
      "features": [
        "Charge 8 Devices: 2 x AC Outlets (230V, 600W, peak 1200W), 2 x 100W USB-C Ports, 2 x 18W USB-A Fast Charging Ports, 1 x Car Cigarette Lighter Socket (12V/10A), 1 x 15W Wireless Charger",
        "600W Output: R600 charge devices like kettles, juicers, laptops, drones, and more. Perfect for outdoor and home",
        "299Wh Large Capacity & Fast Charging: With ALLPOWERS’ fast charging technology, it’s fully charged in just 1 hour using only one cable (no bulky adapters). Max charging power is 400W, faster than most power stations",
        "Fast Solar Charging: 220W solar input, fully charging in 2 hours. Equipped with an solar charging connector for safety and current capacity, making it ideal for charging while camping or off-grid.",
        "Long-Lasting LiFePO4 Battery: The LiFePO4 battery providing over 3,500 charge cycles before capacity drops to 80%, provides 10 years of regular use. The built-in BMS protection system ensures optimal safety by monitoring voltage, current, and temperature.",
        "Reliable Uninterruptible Power Supply: The R600 functions as an uninterruptible power supply (UPS) during power outages, protecting sensitive devices like desktop PCs and file servers from data loss or corruption.",
        "Package Includes: 1 x ALLPOWERS R600 Portable Power Station, 1 x AC Charging Cable, 1 x User Manual",
        "Warranty: 10 years ALLPOWERS' warranty"
      ],
      "last_updated": "2025-09-13T08:31:52.758085",
      "price_available": true,
      "api_source": true,
      "output_wattage": "600",
      "battery_capacity": "299",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "ALLPOWERS 600w Portable Power Station, 299Wh LiFePO4 Battery Backup, R600(Peak 1200w) Solar Generator, 1 Hour Fast Charge Solar Power Bank, for Home Outdoor Travel Emergency RV",
      "affiliate_link": "https://amzn.to/4605svc"
    },
    {
      "asin": "B0BLSLM69P",
      "title": "GRECELL 1000W Portable Power Station With 2x 100W Solar Panels, 999Wh Backup Lithium Battery, Pure Sine Wave AC Outlet, 60W PD Quick Charge Solar Generator Set for Outdoor Emergency Camping Travel",
      "price": "$579.99",
      "currency": "USD",
      "features": [
        "PORTABLE POWER STATION KIT -- 999Wh massive capacity power station with two 100W solar panels, the perfect solution for power outages through solar panels, the best choice for power storage and charging when traveling.",
        "SIMULTANEOUSLY POWER 10 DEVICES -- Equipped with 2 AC outputs, 1 USB-C PD 60W output, 3 USB-A QC3.0 18W outputs, 1 wireless charger, 1 carport, and 2 DC outputs, the GRECELL solar power generator 1000W can power up to 10 devices at the same time (as long as the total power is less than 1000W). Each switch controls each output module.",
        "3 WAYS TO RECHARGE, BUILT-IN MPPT CONTROLLER -- GRECELL solar generator 1000W can be charged from an AC outlet, a solar panel, or a car outlet. Built-in MPPT (Maximum Power Point Tracking Control) extracts maximum power from solar panels, optimizing the utilization of variable power sources such as solar generators.",
        "COMBINE TWO PANELS FOR MORE POWER --A 100W solar panel supports series and parallel connection, so you can expand your solar panel system to meet every need. Pairing a solar panel with another panel can shorten the charging time of your portable power station by up to.",
        "HIGH CONVERSION EFFICIENCY -- Using powerful monocrystalline solar cells to convert sunlight into electricity, generating up to 100W and 20V of mobile power. The solar cell receives the most efficient sunlight with an efficiency of up to 23.5%. The built-in smart chip intelligently recognizes your device and maximizes charging speed, while protecting your device from overcharging and overloading, providing more energy and a longer lifespan than traditional polycrystalline solar panels."
      ],
      "last_updated": "2025-09-13T08:31:52.758123",
      "price_available": true,
      "api_source": true,
      "output_wattage": "1000",
      "battery_capacity": "999",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "GRECELL 1000W Portable Power Station With 2x 100W Solar Panels, 999Wh Backup Lithium Battery, Pure Sine Wave AC Outlet, 60W PD Quick Charge Solar Generator Set for Outdoor Emergency Camping Travel",
      "affiliate_link": "https://amzn.to/4niyXhi"
    },
    {
      "asin": "B0FN7RL92D",
      "title": "pecron Portable Power Station E1000LFP, 1024Wh/1800W LiFePO4 Battery Backup, Solar Generator Expandable to 4096Wh, Fast Charging Power Station for Emergencies, Camping, RV, Home Use",
      "price": "$399.00",
      "currency": "USD",
      "features": [
        "[Power All]: Pecron E1000LFP power station With an impressive output of up to 1800W, this portable power station comes with 12 output, Such as 5xAC Outlets, 2xUSB-C, 2xUSB-A, 1xXT60 Output, 1xCigar Port, 1xDC 5525 Output, which support a wide range of equipment, making it ideal for emergencies, camping, RV trips, and home use.",
        "[78 Mins Fast Charging ]: Fast charging in 1.3 hours, minimizing downtime and keeping your devices powered during your travels.",
        "[Expandable Capacity]: Designed with flexibility in mind, our solar generator can be expanded to accommodate energy requirements of up to 4096Wh, allowing you to handle longer outdoor adventures or unexpected power outages effortlessly.",
        "[Safety & Durable]: The pecron E1000LFP Portable Power Station features a 1024Wh LiFePO4 battery, ensuring a safe and long-lasting power supply for all your energy needs.",
        "[What You Get]: 2+1 years worry-free warranty and 24hrs/7d friendly customer service. pecron E1000 LFP Power Station*1, AC Charging Cable*1, Solar Charging Cable*1, Car Charging Cable*1, Accessory Bag*1, User Manual*1"
      ],
      "last_updated": "2025-09-13T08:31:52.758156",
      "price_available": true,
      "api_source": true,
      "output_wattage": "1800",
      "battery_capacity": "1024",
      "fuel_type": "Solar",
      "engine_type": "Electric",
      "condition": "New",
      "link_text": "Pecron Portable Power Station E1000LFP, 1024Wh/1800W LiFePO4 Battery Backup, Solar Generator Expandable to 4096Wh, Fast Charging Power Station for Emergencies, Camping, RV, Home Use",
      "affiliate_link": "https://amzn.to/3JVcLeZ"
    }
  ]
}